{
  "meta": {
    "title": "{siteName} - Privacy Policy",
    "description": "Learn how {siteName} collects, uses, and protects your personal information"
  },
  "title": "Privacy Policy",
  "lastUpdated": "Last Updated: {lastUpdated}",
  "intro": {
    "title": "Introduction",
    "p1": "Welcome to {siteName}, an artificial intelligence platform that provides image generation, video creation, and other services. {siteName} (hereinafter referred to as \"we\") is committed to protecting your privacy and personal information. This Privacy Policy outlines our practices regarding the collection, storage, use, and sharing of your information when you access and use our services.",
    "p2": "By using our services through the {siteName} website, you acknowledge that you have read, understood, and agreed to the practices described in this Privacy Policy. This policy also informs you of your privacy rights and how the law protects you."
  },
  "dataCollection": {
    "title": "Information We Collect",
    "intro": "We may collect various types of information to provide and improve our services:",
    "provided": {
      "title": "Information You Provide",
      "items": [
        "Account Information: Email address, username, password",
        "Profile Data: Display name, avatar, bio",
        "Payment Details: Billing information, transaction history",
        "Communication Data: Feedback, support inquiries, or other information you send to us"
      ]
    },
    "automatic": {
      "title": "Automatically Collected Information",
      "items": [
        "Device Data: Device type, operating system, browser version, unique device identifiers",
        "Usage Information: Features accessed, images generated, interaction patterns",
        "Log Data: IP address, access times, pages viewed, referring URLs",
        "Cookies and tracking technologies for analytics and functionality"
      ]
    },
    "userContent": {
      "title": "User-Generated Content",
      "content": "Content you create using our services, including AI-generated images, text prompts, uploaded images, and project data. We may temporarily store this content to provide the service and, with your consent, use it to improve our AI models."
    }
  },
  "dataUsage": {
    "title": "How We Use Your Information",
    "intro": "We use the collected information for the following purposes:",
    "items": [
      "Provide, operate, and maintain our AI image generation services",
      "Process your transactions and manage your account",
      "Improve our services through data analysis and usage pattern recognition",
      "Train and enhance our AI models to provide better results",
      "Send service notifications, updates, and promotional information (with your consent)",
      "Detect, prevent, and address fraud, security issues, or technical problems",
      "Comply with legal obligations and enforce our Terms of Service",
      "Provide customer support and respond to your inquiries"
    ]
  },
  "dataSharing": {
    "title": "Information Sharing and Disclosure",
    "intro": "We do not sell your personal information. We only share your information under the following circumstances:",
    "items": [
      "With your explicit consent or at your direction",
      "With trusted service providers who assist in operating our platform (cloud hosting, payment processing, analytics)",
      "With AI model providers under strict data protection agreements to process your generation requests",
      "To comply with legal obligations, court orders, or valid government requests",
      "To protect the rights, property, and safety of ourselves, our users, and the public",
      "In the event of a merger, acquisition, or sale of assets, information may be transferred as a business asset"
    ]
  },
  "dataStorage": {
    "title": "Data Storage and Security",
    "location": {
      "title": "Storage Location",
      "content": "Your information is stored on secure servers located in different regions globally to ensure optimal service performance and reliability. We use industry-leading cloud infrastructure providers."
    },
    "retention": {
      "title": "Retention Period",
      "content": "We retain your personal information only for as long as necessary to fulfill the purposes outlined in this policy or as required by law. Generated content may be retained based on your account settings and subscription type."
    },
    "security": {
      "title": "Security Measures",
      "content": "We employ industry-standard security measures, including encryption (in transit and at rest), access controls, regular security audits, and secure authentication mechanisms. However, no method of transmission or storage is 100% secure."
    }
  },
  "cookies": {
    "title": "Cookies and Tracking Technologies",
    "intro": "We use cookies and similar technologies to enhance your experience:",
    "items": [
      "**Essential Cookies**: Required for basic service functionality and authentication",
      "**Preference Cookies**: Remember your settings and personalization choices",
      "**Analytics Cookies**: Help us understand usage patterns and improve our services",
      "**Marketing Cookies**: Deliver relevant content and measure campaign effectiveness (with your consent)"
    ],
    "note": "You can control cookie preferences through your browser settings. Please note that disabling certain cookies may limit the functionality of our services."
  },
  "userRights": {
    "title": "Your Privacy Rights",
    "intro": "Depending on your region, you may have the following rights related to your personal information:",
    "items": [
      "**Access**: Request a copy of your personal information we hold",
      "**Correction**: Correct inaccurate or incomplete information",
      "**Deletion**: Request deletion of your personal data (\"Right to be Forgotten\")",
      "**Restriction**: Limit how we process your information",
      "**Portability**: Receive your data in a structured, commonly used format",
      "**Object**: Object to processing of your information for certain purposes",
      "**Withdraw Consent**: Withdraw previously given consent at any time",
      "**Opt-Out**: Unsubscribe from marketing communications"
    ]
  },
  "thirdParty": {
    "title": "Third-Party Services and Links",
    "content": "Our service may contain links to third-party websites, integrations, or services. We are not responsible for the privacy practices or content of these third parties. We recommend reviewing their privacy policies before providing any personal information."
  },
  "children": {
    "title": "Children's Privacy",
    "content": "Our services are not intended for individuals under the age of 13 (or the equivalent minimum age in your jurisdiction). We do not knowingly collect personal information from children. If we discover that we have collected data from a child without appropriate consent, we will take steps to delete it promptly."
  },
  "changes": {
    "title": "Changes to This Privacy Policy",
    "content": "We may update this Privacy Policy periodically to reflect changes in our practices or legal requirements. We will notify you of significant changes by posting the updated policy on this page and indicating the revised \"Last Updated\" date at the top. For major changes, we may also provide notice via email or prominently on our platform. We encourage you to review this policy regularly."
  },
  "contact": {
    "title": "Contact Us",
    "intro": "If you have any questions, concerns, or requests regarding this Privacy Policy or our data practices, please contact us:",
    "email": "Email: {email}"
  }
}
