{
  "meta": {
    "title": "{siteName} - Terms of Service",
    "description": "Read {siteName}'s Terms of Service to understand the rules and conditions for using our AI platform"
  },
  "title": "Terms of Service",
  "lastUpdated": "Last Updated: {lastUpdated}",
  "sections": {
    "acceptance": {
      "title": "Acceptance of Terms",
      "intro": "Welcome to {siteName}, an artificial intelligence platform providing image generation, video creation, and other services. These Terms of Service (\"Terms\", \"Agreement\") constitute a legally binding agreement between you (\"User\", \"You\", or \"Your\") and {siteName} (\"We\", \"Our\", or \"Us\") regarding your access to and use of our website services (collectively, the \"Services\").",
      "content": "By accessing, browsing, or using the Services in any way, you acknowledge that you have read, understood, and agree to be bound by these Terms and our Privacy Policy. If you do not agree with these Terms, you must immediately cease using the Services."
    },
    "services": {
      "title": "Service Overview",
      "intro": "{siteName} provides AI-driven creative tools and services, including:",
      "items": [
        "AI image generation from text prompts using advanced machine learning models",
        "AI video generation and creation features",
        "Image editing, enhancement, and style transfer capabilities",
        "Project management, organization, and cloud storage for generated content",
        "Other advanced features and tools provided from time to time"
      ]
    },
    "account": {
      "title": "User Account and Registration",
      "registration": {
        "title": "Registration",
        "content": "To access certain features, you must create an account by providing accurate, complete, and current information. You represent that all information you provide is truthful and that you will maintain the accuracy of this information."
      },
      "security": {
        "title": "Account Security",
        "content": "You are solely responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account. You agree to immediately notify us of any unauthorized access or security breach."
      },
      "transfer": {
        "title": "Account Transfer",
        "content": "Your account is personal to you and may not be transferred, sold, or assigned to any third party without our prior written consent."
      }
    },
    "usage": {
      "title": "Acceptable Use Policy",
      "intro": "You agree not to use the Services to generate, upload, share, or distribute content that:",
      "items": [
        "Violates any applicable laws, regulations, or third-party rights",
        "Contains illegal, harmful, threatening, abusive, harassing, defamatory, or obscene material",
        "Depicts or promotes violence, discrimination, hatred, or intolerance based on protected characteristics",
        "Includes explicit, pornographic, or age-inappropriate content",
        "Infringes upon intellectual property rights, including copyrights, trademarks, or patents",
        "Constitutes spam, phishing, malware, or attempts to compromise platform security",
        "Impersonates any person or entity or misrepresents your affiliation",
        "Involves automated scraping, mining, or unauthorized use of the Services in violation of our guidelines",
        "Exploits, harms, or attempts to exploit minors in any way",
        "Contains demonstrably false, misleading, or deceptive information"
      ]
    },
    "ip": {
      "title": "Intellectual Property",
      "platform": {
        "title": "Platform Ownership",
        "content": "All content, features, functionality, software, designs, text, graphics, logos, and trademarks on the Services are owned by {siteName} or our licensors and are protected by international intellectual property laws. You may not copy, modify, distribute, or reverse engineer any part of the Services without authorization."
      },
      "userContent": {
        "title": "User-Generated Content",
        "content": "You retain ownership of images and content generated using the Services, subject to our limited license below. However, you are responsible for ensuring your use does not infringe third-party rights or violate applicable laws."
      },
      "license": {
        "title": "License Grant",
        "intro": "By using the Services, you grant us a non-exclusive, royalty-free license to use, reproduce, modify, and display your generated content worldwide, solely for the following purposes:",
        "items": [
          "(a) Providing and improving the Services",
          "(b) Training and enhancing our AI models (with your consent)",
          "(c) Marketing and promotional purposes where you have explicitly granted permission"
        ]
      }
    },
    "privacy": {
      "title": "Privacy and Data Protection",
      "content": "We take your privacy seriously. Our collection, use, and protection of your personal information is governed by our Privacy Policy, which is incorporated into these Terms by reference. Please read our Privacy Policy to understand our practices."
    },
    "termination": {
      "title": "Service Modification and Termination",
      "modification": {
        "title": "Modifications",
        "content": "We reserve the right to modify, suspend, or discontinue any aspect of the Services at any time, with or without notice. We may also restrict certain features or limit access to parts of the Services. We are not liable for any modifications or interruptions."
      },
      "ourTermination": {
        "title": "Our Termination",
        "content": "We may, at our sole discretion, immediately suspend or terminate your account and access to the Services without notice if you violate these Terms, engage in fraudulent activity, or for any other reason."
      },
      "effect": {
        "title": "Effect of Termination",
        "content": "Upon termination, your right to use the Services immediately ceases. We may delete your account data and generated content, although some information may be retained as required by law or for legitimate business purposes."
      }
    },
    "disclaimer": {
      "title": "Disclaimers and Limitations",
      "asIs": {
        "title": "As-Is Provision",
        "content": "The Services are provided \"as is\" and \"as available\" without any warranties, express or implied, including but not limited to warranties of merchantability, fitness for a particular purpose, or non-infringement. We do not guarantee that the Services will be uninterrupted, error-free, or secure."
      },
      "liability": {
        "title": "Limitation of Liability",
        "content": "To the maximum extent permitted by law, {siteName} and its affiliates shall not be liable for any indirect, incidental, special, consequential, or punitive damages, including loss of profits, data, or goodwill, arising from your use or inability to use the Services."
      },
      "userResponsibility": {
        "title": "User Responsibility",
        "content": "You acknowledge that AI-generated content may produce unexpected or inaccurate results. You are solely responsible for reviewing, verifying, and determining the appropriateness of any content generated through the Services before using, publishing, or disseminating it."
      }
    },
    "legal": {
      "title": "Governing Law and Dispute Resolution",
      "law": {
        "title": "Governing Law",
        "content": "These Terms shall be governed by and construed in accordance with the laws of the jurisdiction where {siteName} is registered, without regard to its conflict of law principles."
      },
      "disputes": {
        "title": "Dispute Resolution",
        "content": "Any disputes arising out of or relating to these Terms or the Services shall first be attempted to be resolved through good faith negotiation. If negotiation fails, disputes shall be resolved through binding arbitration or litigation in the courts of the applicable jurisdiction, as provided by applicable law."
      }
    },
    "contact": {
      "title": "Contact Information",
      "intro": "If you have any questions, concerns, or feedback about these Terms of Service, please contact us:",
      "email": "Email: {email}"
    }
  }
}
